// 5. *Самостоятельно разобраться с атрибутами тега script (async и defer)/
alert ("async - скрипт независим, страница загружается без ожидания загрузки скрипта. Выполнение скрипта c async происходит по мере загрузки (какой первый загрузился - тот и выполнился)")
alert ("defer - загрузка скрипта в фоновом режиме, браузер продолжает обрабатывать страницу, скрипт при этом запустится когда скрипт будет загружен. defer сохраняет порядок выполнения скриптов относительно друг друга, т.е. все скрипты будут выполнены по очереди.")


